1. Create a DataFrame with the following data:

names = ['Alice', 'Bob', 'Charlie']
ages = [25, 30, 35]
cities = ['New York', 'Los Angeles', 'Chicago']

In [11]:
import pandas as pd
data = { "name" : ['Alice','Bob','Charlie'],
        "ages" : [25,30,35],
        "cities" : ['New York', 'Los Angles', 'Chicago']
        
       }

In [12]:
df = pd.DataFrame(data)

In [13]:
df

      name  ages      cities
0    Alice    25    New York
1      Bob    30  Los Angles
2  Charlie    35     Chicago

2. Create a DataFrame from a dictionary:

data = {'Product': ['A', 'B', 'C'], 'Price': [100, 200, 300]}
Add a new column called Discounted_Price which is 10% less than the original price.

In [15]:
data1 = {'product' : ['A','B','C'],
         'price'  : [100,200,300]   
        }

In [22]:
df1 = pd.DataFrame(data1)
df1['Discounted_price']= df1['price'] * 0.9
df1

  product  price  Discounted_price
0       A    100              90.0
1       B    200             180.0
2       C    300             270.0

3. Create a DataFrame using a list of lists and specify your own column names:

data = [[1, 'Apple'], [2, 'Banana'], [3, 'Cherry']]
Column names: ID, Fruit

In [26]:
data3 = [[1,'Apple'],[2,'Banana'],[3,'Cherry']]
df3  = pd.DataFrame(data3,columns= ["Id","Fruit"])
df3

   Id   Fruit
0   1   Apple
1   2  Banana
2   3  Cherry

4. Given the following two DataFrames:

df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 95]})
Merge them on the ID column using inner join.

Try left, right, and outer joins and observe the difference.

In [28]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 95]})
pd.merge(df1,df2, how='inner')

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90

In [30]:
pd.merge(df1,df2, how ='outer')

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0
3   4      NaN   95.0

In [32]:
pd.merge(df1,df2, how='left')

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0

In [34]:
pd.merge(df1,df2,how ="right")

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90
2   4      NaN     95

5. Perform a merge where the key columns have different names:

df1 = pd.DataFrame({'emp_id': [1, 2, 3], 'Name': ['Tom', 'Jerry', 'Spike']})
df2 = pd.DataFrame({'id': [1, 2, 4], 'Department': ['HR', 'Finance', 'IT']})
Merge df1 and df2 where emp_id matches id.

In [37]:
df1 = pd.DataFrame({'emp_id': [1, 2, 3], 'Name': ['Tom', 'Jerry', 'Spike']}) 
df2 = pd.DataFrame({'id': [1, 2, 4], 'Department': ['HR', 'Finance', 'IT']})
pd.merge(df1,df2,left_on='emp_id',right_on='id',how='inner')

   emp_id   Name  id Department
0       1    Tom   1         HR
1       2  Jerry   2    Finance

6.Create two DataFrames with custom index:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob']}, index=[1, 2]) df2 = pd.DataFrame({'Score': [90, 85]}, index=[2, 3]) Perform a join using .join() with how='inner' and how='outer'

In [39]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob']}, index=[1, 2]) 
df2 = pd.DataFrame({'Score': [90, 85]}, index=[2, 3])

In [42]:
df1.join(df2, how='inner')

  Name  Score
2  Bob     90

In [44]:
df1.join(df2, how='outer')

    Name  Score
1  Alice    NaN
2    Bob   90.0
3    NaN   85.0

7.Create a scenario where you have a left DataFrame with customer data and a right DataFrame with their orders. Perform a join to show all customers and their orders (if any).

In [45]:
customers = pd.DataFrame({
    'customer_id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'Diana']
})

orders = pd.DataFrame({
    'order_id': [101, 102, 103],
    'customer_id': [1, 2, 2],
    'product': ['Laptop', 'Phone', 'Tablet']
})

pd.merge(customers,orders,on='customer_id',how='outer')

   customer_id     name  order_id product
0            1    Alice     101.0  Laptop
1            2      Bob     102.0   Phone
2            2      Bob     103.0  Tablet
3            3  Charlie       NaN     NaN
4            4    Diana       NaN     NaN